app/views/articles/show.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "has_categories" ON "categories"."id" = "has_categories"."category_id" WHERE "has_categories"."article_id" = ?  [["article_id", 7]]
---

  <% @article.categories.each do |category| %>