app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "body", "user_id", "visits_count", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "demo 5"], ["body", "detalle 5"], ["user_id", 1], ["visits_count", 0], ["created_at", "2016-05-15 12:57:46.744151"], ["updated_at", "2016-05-15 12:57:46.744151"]]
INSERT INTO "has_categories" ("category_id", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["category_id", 2], ["article_id", 2], ["created_at", "2016-05-15 16:41:00.842916"], ["updated_at", "2016-05-15 16:41:00.842916"]]
---
  def create
    #@article = Article.new(title: params[:article][:title], body: params[:article][:body])
    #@article = Article.new(article_params)

    @article = current_user.articles.new(article_params)
    @article.categories = params[:categories]

    # @article.valid?
    # @article.invalid?
    if @article.save

UPDATE "articles" SET "body" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["body", " detalle 33"], ["updated_at", "2016-05-14 21:48:25.154324"], ["id", 5]]
---
  def update
    if @article.update(article_params)