app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "user_id", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "sds"], ["user_id", 1], ["article_id", 10], ["created_at", "2016-05-15 13:13:59.879160"], ["updated_at", "2016-05-15 13:13:59.879160"]]
---
  def create
    @comment = current_user.comments.new(comment_params)
    @comment.article = @article

    respond_to do |format|
      if @comment.save